# Taps
tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "micronaut-projects/tap"

# Homebrew Packages
brew "fzf"
brew "bat"
brew "ripgrep"
brew "htop"
brew "tldr"
brew "zoxide"
brew "docker-compose"
brew "eza"
brew "fd"
brew "watch"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "age"
brew "sops"
brew "aider"
brew "awscli"
brew "coreutils"
brew "curl"
brew "docker"
brew "duti"
brew "fd"
brew "gh"
brew "git"
brew "gitleaks"
brew "gnupg"
brew "jenv"
brew "libevent"
brew "libssh2"
brew "mas"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk@11"
brew "openjdk@17"
brew "openjdk@21"
brew "openldap"
brew "openssl@1.1"
brew "pnpm"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "rtmpdump"
brew "starship"

# Casks
cask_args appdir: "/Applications"

cask "1password"
cask "1password-cli"
cask "contexts"
cask "dbeaver-community"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-monaspace"
cask "fontbase"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gqrx"
cask "iterm2"
cask "jetbrains-toolbox"
cask "josm"
cask "micronaut"
cask "qlmarkdown"
cask "replacicon"
cask "setapp"
cask "spotify"
cask "tower"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# App Store Apps
mas "Slack", id: 803453959
mas "Amphetamine", id: 937984704
mas "Home Assistant", id: 1099568401
mas "CardPointers", id: 1472875808
mas "iMovie", id: 408981434

# Visual Studio Code plugins
vscode "1password.op-vscode"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.amazon-q-vscode"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.path-intellisense"
vscode "codebuddyai.codebuddy-ai"
vscode "codezombiech.gitignore"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "k--kato.intellij-idea-keybindings"
vscode "keesschollaart.vscode-home-assistant"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "mathiasfrohlich.kotlin"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "naco-siren.gradle-language"
vscode "netcorext.uuid-generator"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "tomiy.windev-wlanguage"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
