cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/bundle"
tap "adoptopenjdk/openjdk"
tap "1password/tap"

# Dependencies
brew "mas"
brew "git"
brew "gh"
brew "curl"
brew "coreutils"
brew "duti"
brew "node"
brew "pyenv"
brew "jenv"
brew "starship"
brew "docker"
brew "gitleaks"

# Mac Applications
cask "google-cloud-sdk"
cask "iterm2"
cask "tower"
cask "jetbrains-toolbox"
cask "visual-studio-code"
cask "1password"
cask "1password-cli"
cask "setapp"
cask "google-chrome"
cask "spotify"
cask "josm"
cask "grammarly"
cask "transmission"
cask "zoom"
cask "contexts"
cask "vlc"

# App Store
mas "TickTick", id: 966085870
mas "Slack", id: 803453959
mas "Amphetamine", id: 937984704
mas "Home Assistant", id: 1099568401
mas "CardPointers", id: 1472875808
mas "Magnet", id: 441258766
mas "iMovie", id: 408981434
mas "MQTT Explorer", id: 1455214828

# Visual Studio Code plugins
vscode "mathiasfrohlich.Kotlin"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "NicolasVuillamy.vscode-groovy-lint"
vscode "be5invis.toml"
vscode "esbenp.prettier-vscode"
vscode "keesschollaart.vscode-home-assistant"
vscode "PKief.material-icon-theme"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "akamud.vscode-theme-onedark"
vscode "EditorConfig.EditorConfig"
vscode "mikestead.dotenv"
vscode "k--kato.intellij-idea-keybindings"
