cask_args appdir: "/Applications"

# Tap Homebrew
tap "homebrew/cask"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# System
brew "mas"
brew "git"
brew "gh"
brew "curl"
brew "coreutils"
brew "duti"
brew "node"
brew "pyenv"
brew "jenv"
brew "starship"

# Ops
cask "google-cloud-sdk"

# Dev
cask "iterm2"
cask "tower"
cask "jetbrains-toolbox"
cask "visual-studio-code"

# Misc
cask "1password"
cask "setapp"
cask "google-chrome"
cask "spotify"
cask "josm"
cask "grammarly"
cask "transmission"
cask "zoom"
cask "contexts"

# App Store
mas "Fantastical", id: 975937182
mas "TickTick", id: 966085870
mas "Slack", id: 803453959
mas "Amphetamine", id: 937984704
